In [2]:
import numpy as n
import sqlalchemy as sql

%reload_ext sql

from snowflake.sqlalchemy import URL
from sqlalchemy import create_engine

user = 'sfadmin'
connection_string = "snowflake://{user}:{password}@aa85077.eu-central-1".format(user='usercd ', password="snflk_pwd")

%sql $connection_string

%sql use database courses;
%sql use warehouse compute_wh;
%sql use schema sch_czechita;

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Vypiš eventdate, gname, nkill, nwound z tabulky teror2 (!) a přes sloupeček country připoj zemi z tabulky country

In [ ]:
%%sql
SELECT t2.eventdate, t2.gname, t2.nkill, t2.nwound, c.name as country_name
 FROM teror2 AS t2
 LEFT JOIN country AS c 
 ON t2.country = c.id;

Vypiš eventdate, gname, nkill, nwound z tabulky teror2 (!) a
- přes sloupeček country připoj zemi z tabulky country
- přes sloupeček weaptype1 připoj název zbraně z tabulky weaptype
- přes sloupeček weaptype2 připoj název zbraně z tabulky weaptype

In [ ]:
%%sql
SELECT t2.eventdate, t2.gname, t2.nkill, t2.nwound, c.name as country_name, wt1.name as weapon_type1, wt2.name as weapon_type2
 FROM teror2 AS t2
 LEFT JOIN country as c ON t2.country = c.id
 LEFT JOIN weaptype as wt1 ON t2.weaptype1 = wt1.id
 LEFT JOIN weaptype as wt2 ON t2.weaptype2 = wt2.id;

Vypiš eventdate, gname, nkill, nwound z tabulky teror2 (!) a
- přes sloupeček country připoj zemi z tabulky country
- přes sloupeček weaptype1 připoj název zbraně z tabulky weaptype
- přes sloupeček weaptype2 připoj název zbraně z tabulky weaptype
- vypiš jen útoky jejichž sekundární zbraň byla zápalná ('Incendiary')

In [ ]:
%%sql
SELECT t2.eventdate, t2.gname, t2.nkill, t2.nwound, c.name as country_name, wt1.name as weapon_type1, wt2.name as weapon_type2
 FROM teror2 AS t2
 LEFT JOIN country as c ON t2.country = c.id
 LEFT JOIN weaptype as wt1 ON t2.weaptype1 = wt1.id
 LEFT JOIN weaptype as wt2 ON t2.weaptype2 = wt2.id
 WHERE wt2.name = 'Incendiary';

Z tabulky teror2 vypiš počet útoků, počty mrtvých a raněných v roce 2016 -- podle použitých zbraní (WEAPTYPE1)

In [ ]:
%%sql
SELECT wt1.name as weapon_type1, count(*) as attacks, sum(t2.nkill) as nkill_sum, sum(t2.nwound) as nwound_sum 
FROM teror2 as t2
 LEFT JOIN country as c ON t2.country = c.id
 LEFT JOIN weaptype as wt1 ON t2.weaptype1 = wt1.id
 WHERE date_part(year, eventdate) = 2016
 GROUP BY wt1.name
 ORDER BY COUNT(*) DESC;

Vypište počet unesených lidí (kdy byl typ útoku únos rukojmích) a počet událostí podle regionu a roku. 
Výsledek seřaďte podle počtu unesených lidí sestupně.
Sloupečky pojmenujte region, rok, pocet_unesenych, pocet_udalosti

In [ ]:
%%sql
SELECT reg.name AS region, year(t2.eventdate) AS rok, SUM(t2.nhostkid) AS pocet_unesenych, COUNT(*) AS pocet_udalosti
 FROM teror2 AS t2
 JOIN attacktype AS at1 ON t2.attacktype1 = at1.id
 JOIN region AS reg ON t2.region = reg.id
 WHERE at1.name LIKE 'Hostage Taking %' AND t2.nhostkid > 0
 GROUP BY reg.name, year(t2.eventdate)
 ORDER BY SUM(nhostkid) DESC;

Zjisti počty útoků z tabulky teror2 po letech a kontinentech. Tj. napoj sloupeček region z tabulky teror2 na tabulku region a vytvoř sloupeček kontinent z názvu regionu a podle něj a podle roku tabulku "zgrupuj" (zagreguj).

In [ ]:
%%sql
SELECT CASE --vyber ze seznamu hodnot bude pri miliardach radek rychlejsi... Proc asi?
        -- pres region misto region_txt by to mozna bylo jeste rychlejsi...
         WHEN reg.name in ('Western Europe', 'Eastern Europe') THEN 'Europe'
         WHEN reg.name in ('Middle East & North Africa', 'Sub-Saharan Africa') THEN 'Africa'
         WHEN reg.name in ('East Asia', 'Southeast Asia', 'South Asia', 'Central Asia') THEN 'Asia'
         WHEN reg.name in ('North America', 'Central America & Caribbean', 'South America') THEN 'America'
         WHEN reg.name  = 'Australasia & Oceania' THEN 'Australia'
         ELSE reg.name
       END AS kontinent, 
       year(eventdate) as rok,
       count(*) utoku_celkem 
 FROM teror2 as t2
 LEFT JOIN region as reg
 ON t2.region=reg.id
 GROUP BY 
 --potrebujeme tabulku zgrupovat po kontinentech a letech
  kontinent,rok;